{
  "enchantment.flowingagony.an_enchanted_golden_apple_a_day": "An Enchanted Gold Apple A Day",
  "enchantment.flowingagony.deathpunk": "Deathpunk",
  "enchantment.flowingagony.exotic_healer": "Exotic Healer",
  "enchantment.flowingagony.savor_the_tasted": "Savor The Tasted",
  "enchantment.flowingagony.cleansing_before_using": "Cleansing Before Using",
  "enchantment.flowingagony.come_back_at_dusk": "Come Back at Dusk",
  "enchantment.flowingagony.dirty_money": "Dirty Money",
  "enchantment.flowingagony.pilferage_creed": "Pilferage Creed",
  "enchantment.flowingagony.regular_customer_program": "Regular Customer Program",
  "enchantment.flowingagony.armor_up": "Armor Up!",
  "enchantment.flowingagony.frivolous_step": "Frivolous Step",
  "enchantment.flowingagony.miraculous_escape": "Miraculous Escape",
  "enchantment.flowingagony.potential_burst": "Potential Burst",
  "enchantment.flowingagony.stubborn_step": "Stubborn Step",
  "enchantment.flowingagony.infectious_malice": "Infectious Malice",
  "enchantment.flowingagony.i_see_you_now": "I See You Now",
  "enchantment.flowingagony.malice_outbreak": "Malice Outbreak",
  "enchantment.flowingagony.perceived_malice": "Perceived Malice",
  "enchantment.flowingagony.vengeance": "Vengeance",
  "enchantment.flowingagony.agony_screamer": "Agony Screamer",
  "enchantment.flowingagony.insane_poet": "Insane Poet",
  "enchantment.flowingagony.paper_brain": "Paper Brain",
  "enchantment.flowingagony.shock_therapy": "Shock Therapy",
  "enchantment.flowingagony.cutting_watermelon_dream": "Cutting Watermalon Dream",
  "enchantment.flowingagony.burning_phobia": "Burning Phobia",
  "enchantment.flowingagony.drowning_phobia": "Drowning Phobia",
  "enchantment.flowingagony.prayer_of_pain": "Prayer of Pain",
  "enchantment.flowingagony.piercing_fever": "Piercing Fever",
  "enchantment.flowingagony.constrained_heart": "Constrained Heart",
  "enchantment.flowingagony.fresh_revenge": "Fresh Revenge",
  "enchantment.flowingagony.hatred_bloodline": "Hatred Bloodline",
  "enchantment.flowingagony.outrageous_spirit": "Outrageous Spirit",
  "enchantment.flowingagony.resentful_soul": "Resentful Soul",
  "enchantment.flowingagony.too_resentful_to_die": "Too Resentful to Die",
  "enchantment.flowingagony.morirs_deathwish": "Dragon Morir's Deathwish",
  "enchantment.flowingagony.morirs_lifebound": "Dragon Morir's Lifebound",
  "enchantment.flowingagony.necessary_evil": "Necessary Evil",
  "enchantment.flowingagony.survival_ruse": "Survival Ruse",
  "enchantment.flowingagony.survival_shortcut": "Survival Shortcut",
  "enchantment.flowingagony.trickster": "Trickster",
  "enchantment.flowingagony.corrupted_kindred": "Corrupted Kindred",
  "enchantment.flowingagony.lightburn_fungal_parasitic": "Lightburn Fungal Parasitic",
  "enchantment.flowingagony.prototype_chaotic": "Prototype Chaotic",
  "enchantment.flowingagony.prototype_chaotic_type_beta": "Prototype Chaotic Type β",
  "enchantment.flowingagony.shadowborn": "Shadowborn",
  "enchantment.flowingagony.burial_object": "Burial Object",
  "enchantment.flowingagony.encious_kind": "Envious Kind",
  "enchantment.flowingagony.eyesore": "Eyesore",
  "enchantment.flowingagony.thorn_in_flesh": "Thorn in Flesh",
  "enchantment.flowingagony.covert_knife": "Covert Knife",
  "enchantment.flowingagony.source_of_envy": "Source of Envy",

  "enchantment.flowingagony.an_enchanted_golden_apple_a_day.desc": "For every piece of armor with this enchantment, you will get one of the buffs that an enchanted golden apple can bring every time you cross the dimension.",
  "enchantment.flowingagony.deathpunk.desc": "Except a fatal fall into the void, when receiving a deadly damage, there is a 25% probability that your health value will be swapped with the hunger value, a 25% probability that your health value will be swapped with the oxygen value, a 25% probability that your health value will be filled up by experience points (30 experience points can be turned into 1 heart), and a 25% probability that you sacrifice this enchantment in exchange for full recovery. If your condition cannot meet the random effect, you will lose this enchantment in exchange for full recovery.",
  "enchantment.flowingagony.exotic_healer.desc": "When your health is about to be restored, there is a 33% probability that you will not get the restoration effect, a 33% probability that you will get a double restoration effect, a 24% probability that you will get a triple restoration effect, a 5% probability that the restoration effect will remain unavailable, a 1% probability that you will get a 30s Strength buff, 1% probability gives you 30s Speed buff, 1% probability that you will get a 30s Regeneration buff, 1% probability that you will get 30s Invisibility buff, and a 1% probability that the recovery effect will be converted into damage.。",
  "enchantment.flowingagony.savor_the_tasted.desc": "Increases your weapon attack power randomly by 30%-70%/70%-120%/120%-180% when you attack one kind of creatures repeatedly. This increase is reset when you attack another different kind of creatures.",
  "enchantment.flowingagony.cleansing_before_using.desc": "Reduces the cost of experience points to 1 when repairing it on the anvil, only if the item is in full durability. Will be consumed after the repair. Won't be activated if items are not compatible with one another.",
  "enchantment.flowingagony.come_back_at_dusk.desc": "Gives you the buff \"Hero of the Village\" at dusk.",
  "enchantment.flowingagony.dirty_money.desc": "Drops 0-1/1-2 emeralds and 0-1/0-2 gold ingots when killing a villager. Invalidates the buff \"Hero of the Village\" on you. This buff is determined by the highest enchantment level on your armors. Invalidates the \"Come Back at Dusk\" enchantment on any armor.",
  "enchantment.flowingagony.pilferage_creed.desc": "Enables you to steal 0-3 items from a villager's trading list by a certain probability when landing benearth it. The number of stolen items cannot exceed half of the number of items in the list. The whole procedure makes three judgements and steals one (or not) within each. The probability is 30%|15%|5% when falling from a position of 5 blocks and 80%|40%|20% when falling from a position of 15 blocks, varied with the landing height. Causes a 1-6 point(s) of damage to the villager by a probability from 30% to 80% at the same time, varied also with the landing height. Causes 30 points of durability to the shoes after every steal.",
  "enchantment.flowingagony.regular_customer_program.desc": "Repeatedly killing a certain mob will drop 3-6 gold nuggets, with extra 3-6 gold nuggets if the mob is a monster.",
  "enchantment.flowingagony.armor_up.desc": "Gives you one point of absorption health every time you receive damage when your points of health are less than 6/7/8. The upper limit of absorption health is 10/15/20 points.",
  "enchantment.flowingagony.frivolous_step.desc": "Removes the Slowness effect on yoyu when you're attacked. Increases your speed by 70%/90% in 10 seconds.",
  "enchantment.flowingagony.miraculous_escape.desc": "Avoids the damage to you when your hearts are less than 4, and at the same time you will be ejected overhead and gain directional control in a short time. Keeps you immune from damages caused by falling, cramming and suffocation. Has a 10-second-long cooldown.",
  "enchantment.flowingagony.potential_burst.desc": "Enables you to jump higher when health value drops below 8/10 hearts and increases walking speed by 30%/50%. Doesn't affect the speed of running, swimming and flying.",
  "enchantment.flowingagony.stubborn_step.desc": "Removes the Levitation effect on you when you're attacked. Weakens the knockback effect by 50%/70%.",
  "enchantment.flowingagony.infectious_malice.desc": "Spreads random debuff from a attacker to surrounding creatures of the same type once you're attacked. One more enchantment total level you have, one more debuff will be redistributed. If this attacker is a player, then he will be subjected to the debuff  \"Cursed Hatred III\" for the duration of 10 times the number of enchanted armors equipped.",
  "enchantment.flowingagony.i_see_you_now.desc": "Highlights the creatures attacking you.",
  "enchantment.flowingagony.malice_outbreak.desc": "Greatly knockbacks any creature who is attacking you, in the direction which you are facing.",
  "enchantment.flowingagony.perceived_malice.desc": "Applies 30 seconds of the debuff \"Cursed Antipathy\" to the creatures attacking you. Enables you to perceive nearby monsters. (Cursed Antipathy: Causes 1 point damage to you every 2/1/0.5 second(s))",
  "enchantment.flowingagony.vengeance.desc": "Applies 30 seconds of the debuff \"Cursed Hatred\" to the creatures attacking you. (Cursed Hatred: Greatly strengthens the damage inflicted on one by 50%/80%/110.)",
  "enchantment.flowingagony.agony_screamer.desc": "Imposes the debuff \"Agony Resonance\" for 20 seconds on the attacked target. (Agony Resonance: Imposes the buff \"Been Resonated\" for 20 seconds on all the nearby mobs) (Been Resonated: Causes the same damage as you to all the nearby mobs who is in the debuff \"Agony Resonance\")",
  "enchantment.flowingagony.insane_poet.desc": "Reduces the attack damage of bow to 10% by default and imposes the buff \"Listen to Me Singing\" for 20 seconds on the attacked target. (Listen to Me Singing: The victim will be repeatedly forcibly lifted and then smashed towards the ground every 2s. Causes certain damage that is calculated by: max health value x 0.1 + current health value x 0.4.)",
  "enchantment.flowingagony.paper_brain.desc": "Reduces the attack damage of sword to 10% by default and makes all the attacked mobs not able to follow almost any target within 3/5/7s and receive damage of 1 point by a probability of 30%/40%/50% every 0.25 second during this period. This damage ignores any armor.",
  "enchantment.flowingagony.shock_therapy.desc": "Reduces the attack damage of sword to 10% by default. Makes all the attacked mobs not able to follow almost any target within 3/5/7s. Gives them at the same time damage of 1 point by a probability of 30%/40%/50% every 0.25 second during this period. This damage ignores any armor.",
  "enchantment.flowingagony.cutting_watermelon_dream.desc": "When you use a tool without the enchantment \"Silk Touch\" to destroy watermalons, all nearby monsters will receive damage that equals 2 to 3 times the damage the tool can deal. Doubles the effect during night.",
  "enchantment.flowingagony.burning_phobia.desc": "Inflicts the debuff \"Nausea\" and \"Slowness\" for 30 seconds once you are hurt, by any source except fire and lava. When you are in the fire or lava, gives damage to all nearby monsters or an attacker that triples the damage you take.",
  "enchantment.flowingagony.drowning_phobia.desc": "Inflicts the debuff \"Nausea\" and \"Blindness\" for 30 seconds once you are hurt while swimming, meanwhile causes damage that triples the damage you take to all nearby monsters or an attacker.",
  "enchantment.flowingagony.prayer_of_pain.desc": "Grants you the buff \"Let Me Savor It!\" when you are hurt and your hearts are less than 6/8/10. If you already have the buff \"Let Me Savor It!\", it'll get level up. (Let Me Savor It!: Decreases your attack damage by buff level x 9% and instead gives the attacker a certain damage that is calculated by the following formula. The damage to the attacker = the damage you take * buff level * 45% + damage you take * 50%. This buff will vanish once your hearts are higher than 12)",
  "enchantment.flowingagony.piercing_feve.descr": "Grants you 1 point of the capability \"Abnormal Joy\" once you take 1 point of damage from cactus, mobs and players. (Abnormal Joy: Consumes 1 capability point to deal 2 points of damage on attack. The maximum capability point you can consume per attack is 5. Consuming 5 capability points brings 5 more points of damage. All damage dealt by capability ignores armor. Capability points won't disappear on death)",
  "enchantment.flowingagony.constrained_heart.desc": "Grants you 1 point of the capability \"Abnormal Joy\" once you take 1 point of damage by falling, cramming, suffocation, wither, burning, lava or poison. (Abnormal Joy: Consumes 1 capability point to deal 2 points of damage on attack. The maximum capability point you can consume per attack is 5. Consuming 5 capability points brings 5 more points of damage. All damage dealt by capability ignores armor. Capability points won't disappear on death)",
  "enchantment.flowingagony.fresh_revenge.desc": "Increases attack damage by 50%~150% for 5/10/15 seconds if you attack the creature who has just attacked you. Lasts 0.8/1/1.2 second(s).",
  "enchantment.flowingagony.hatred_bloodline.desc": "Within the 40 seconds after respawn, increases your movement speed by 8.33%, attack damage by 25% and attack speed by 8.33%. Effect augmented by every enchantment level on your armor.",
  "enchantment.flowingagony.outrageous_spirit.desc": "For each debuff you have (including burning), increases your attack damage by 30%/40%/50%.",
  "enchantment.flowingagony.resentful_soul.desc": "Prevents you from death if the creature who has just attacked you is nearby. Lasts 5/7.5/10 seconds after each attack.",
  "enchantment.flowingagony.too_resentful_to_die.desc": "Enables you to restore immediately 4/7/10 hearts and obtain the \"Extreme Hatred\" buff as soon as you're dying. For the second time of being dying, you'll restore 3/5/7 hearts and obtain the \"Extreme Hatred Ⅱ\" Buff. For the third time, 2/3/5 hearts and the \"Extreme Hatred Ⅲ\" buff. No more effects after. (Extreme Hatred: Tremedously increases attack damage by 2/3/4 but consumes more hunger points by 15/7/5 ticks per hunger point. Lasts until you kill a creature.)",
  "enchantment.flowingagony.morirs_deathwish.desc": "For each point of damage you take, the items you wear or hold will restore 3 points of durability. After you die, the items will restore 64 points of durability.",
  "enchantment.flowingagony.morirs_lifebound.desc": "For each heart you restore, the items you wear or hold will restore 10 points of durability. After you die, the items will lose 64 points of durability.",
  "enchantment.flowingagony.necessary_evil.desc": "You won't take a damage when it's greater than 10 points and instead, all mobs nearby will take this damage. If there is no much a mob nearby, the damage will be reduced by 50% except for it of explosion, who will be reduced by 75%.",
  "enchantment.flowingagony.survival_ruse.desc": "You won't take a damage when it's greater than 6 points and instead, a hostile mob nearby will take this damage. If there is no such a mob, the damage will be reduced by 25% except for it of explosion, who will be reduced by 50%.",
  "enchantment.flowingagony.survival_shortcut.desc": "You won't take a damage when it's greater than 6 points and instead, a passive or neutral mob nearby will take this damage. If there is no such a mob, the damage will be reduced by 25% except for it of explosion, who will be reduced by 50%.",
  "enchantment.flowingagony.trickster.desc": "Randomly gives your attack 1 or 2 extra negative effect(s) like Poison, Wither, Weakness, Slowness or burning.",
  "enchantment.flowingagony.corrupted_kindred.desc": "Grants you invulnerability to common undead creatures, reduces damage from other undead creatures by 30%/40%/50%, and reduces damage from wither by 10%/15%/20%.  3%/2%/1% of Undead's attacks can inflict the debuff \"Curse of Undead\". (Curse of Undead: You burn like a zombie under daylight! A halmet is necessary to block the damage. Largely increases the damage of fire and enables fire to cause damage on halmets. Rather than milk, the debuff can only be removed by enchanted golden apples or death. No more negative effects of hunger under this debuff and you can restore 10 hearts by eating rotten meat.)",
  "enchantment.flowingagony.lightburn_fungal_parasitic.desc": "Grants you immunity to the debuff \"Poison\", reduces falling damage by 20%, reduces explosion damage by 20% and reduces burning damage by 30%. Spreads 10 seconds of the debuff \"Lightburn Fungal Infection\" to all surrounding creatures once you are attacked. (Lightburn Fungal Infection: Causes 3 points of damage every 2 seconds. Players with the enchantment \"Lightburn Fungal Parastic\" are free from this effect.)",
  "enchantment.flowingagony.prototype_chaotic.desc": "Grants you 2/3/4 absorption hearts each time you obtain a new effect or refresh an existing effect. Up to 20/30/40 hearts maximum.",
  "enchantment.flowingagony.prototype_chaotic_type_beta.desc": "Duration of every buff you obatin will be extended by 100%. If Prototype Chaotic Enchantment exists, duration of buff you obatin will be extended by an extra 100%. All debuffs curable by milk will be removed once you obtain a buff.",
  "enchantment.flowingagony.shadowborn.desc": "Grants you the buff \"Night Vision\" when the light-level is below 5. Grants you immunity to the debuff \"Blindness\" when the light-level is above 5.",
  "enchantment.flowingagony.burial_object.desc": "Kills you as soon as any nearby player is dead.",
  "enchantment.flowingagony.encious_kind.desc": "Grants you the buff \"Envious Being\" for 10 seconds when you attack a target who has more hearts than your. Level of the buff granted is decided by the difference of health points between yours and the target's. Low-level buff would be replaced by high-level one. (Envious Being: Increases attack damage by 4 points. Grants you extra 1 point attack damage for every buff level.)",
  "enchantment.flowingagony.eyesore.desc": "Generates an explosion on the arrow in 3 seconds after hitting the target. Causes \"Blindness\" to the target if still alive.",
  "enchantment.flowingagony.thorn_in_flesh.desc": "The victim's movement speed will be decreased by 50% for 9 seconds and the victim will stop moving for every 2.5 seconds due to tremedous pain.",
  "enchantment.flowingagony.covert_knife.desc": "Enderman cannot evade arrow fired from bow with this enchantment.",
  "enchantment.flowingagony.source_of_envy.desc": "Makes creature who attacked you an attacking target of its own kind.",

  "effect.flowingagony.cursed_hatred": "Cursed Hatred",
  "effect.flowingagony.cursed_antipathy": "Cursed Antipathy",
  "effect.flowingagony.extreme_hatred": "Extreme Hatred",
  "effect.flowingagony.agony_resonance": "Agony Resonance",
  "effect.flowingagony.been_resonated": "Been Resonated",
  "effect.flowingagony.let_me_savor_it": "Let Me Savor It!",
  "effect.flowingagony.listen_to_me_singing": "Listen to Me Singing!",
  "effect.flowingagony.curse_of_undead": "Curse of Undead",
  "effect.flowingagony.lightburn_fungal_infection": "Lightburn Fungal Infection",
  "effect.flowingagony.encious_being": "Envious Being",

  "death.attack.flowingagony.burial_object_curse":"%1$s died as burial object of %2$s .",
  "death.attack.flowingagony.cursed_antipathy":"%1$s died as antipathy burned him from inside.",
  "death.attack.flowingagony.exotic_healer":"%1$s now thinks Doomfist is a good choice to main.",
  "death.attack.flowingagony.lightburn_fungal_infection":"%1$s turned into light.",
  "death.attack.flowingagony.let_me_savor_it":"%1$s died from suffering due to attacking %2$s Who was enjoying suffering"
}